## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bs-co-mtasts.azurerm_cdn_endpoint.mtastsendpoint will be destroyed
  # (because azurerm_cdn_endpoint.mtastsendpoint is not in configuration)
  - resource "azurerm_cdn_endpoint" "mtastsendpoint" {
      - content_types_to_compress     = [] -> null
      - fqdn                          = "cdnbscomtasts.azureedge.net" -> null
      - id                            = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/cdn-mjwmtasts/endpoints/cdnbscomtasts" -> null
      - is_compression_enabled        = false -> null
      - is_http_allowed               = false -> null
      - is_https_allowed              = true -> null
      - location                      = "global" -> null
      - name                          = "cdnbscomtasts" -> null
      - origin_host_header            = "stbscomtasts.z33.web.core.windows.net" -> null
      - profile_name                  = "cdn-mjwmtasts" -> null
      - querystring_caching_behaviour = "IgnoreQueryString" -> null
      - resource_group_name           = "rg-whitefam-cdnprofiles" -> null
      - tags                          = {
          - "managed"    = "as-code"
          - "repository" = "MattWhite-personal/dns-iac"
          - "source"     = "terraform"
        } -> null
        # (3 unchanged attributes hidden)

      - delivery_rule {
          - name  = "EnforceHTTPS" -> null
          - order = 1 -> null

          - request_scheme_condition {
              - match_values     = [
                  - "HTTP",
                ] -> null
              - negate_condition = false -> null
              - operator         = "Equal" -> null
            }

          - url_redirect_action {
              - protocol      = "Https" -> null
              - redirect_type = "Found" -> null
                # (4 unchanged attributes hidden)
            }
        }

      - origin {
          - host_name  = "stbscomtasts.z33.web.core.windows.net" -> null
          - http_port  = 80 -> null
          - https_port = 443 -> null
          - name       = "mtasts-endpoint" -> null
        }
    }

  # module.bs-co-mtasts.azurerm_cdn_endpoint_custom_domain.mtastscustomdomain will be destroyed
  # (because azurerm_cdn_endpoint_custom_domain.mtastscustomdomain is not in configuration)
  - resource "azurerm_cdn_endpoint_custom_domain" "mtastscustomdomain" {
      - cdn_endpoint_id = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/cdn-mjwmtasts/endpoints/cdnbscomtasts" -> null
      - host_name       = "mta-sts.benchspace.co" -> null
      - id              = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/cdn-mjwmtasts/endpoints/cdnbscomtasts/customDomains/cdnbscomtasts" -> null
      - name            = "cdnbscomtasts" -> null

      - cdn_managed_https {
          - certificate_type = "Dedicated" -> null
          - protocol_type    = "ServerNameIndication" -> null
          - tls_version      = "TLS12" -> null
        }
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_custom_domain.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "mta-sts" {
      + cdn_frontdoor_profile_id = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam"
      + dns_zone_id              = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/benchspace.co"
      + expiration_date          = (known after apply)
      + host_name                = "mta-sts.benchspace.co"
      + id                       = (known after apply)
      + name                     = "cdnbscomtasts"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_custom_domain_association.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "mta-sts" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_endpoint.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "mta-sts" {
      + cdn_frontdoor_profile_id = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam"
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "cdnbscomtasts"
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_origin.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin" "mta-sts" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "example-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_origin_group.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "mta-sts" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam"
      + id                                                        = (known after apply)
      + name                                                      = "cdnbscomtasts"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.bs-co-mtasts.azurerm_cdn_frontdoor_route.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_route" "mta-sts" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "cdnbscomtasts"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.bs-co-mtasts.azurerm_dns_cname_record.cdnverify will be destroyed
  # (because azurerm_dns_cname_record.cdnverify is not in configuration)
  - resource "azurerm_dns_cname_record" "cdnverify" {
      - fqdn                = "cdnverify.mta-sts.benchspace.co." -> null
      - id                  = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/benchspace.co/CNAME/cdnverify.mta-sts" -> null
      - name                = "cdnverify.mta-sts" -> null
      - record              = "cdnverify.cdnbscomtasts.azureedge.net" -> null
      - resource_group_name = "rg-whitefam-dnszones" -> null
      - tags                = {
          - "managed"    = "as-code"
          - "repository" = "MattWhite-personal/dns-iac"
          - "source"     = "terraform"
        } -> null
      - ttl                 = 300 -> null
      - zone_name           = "benchspace.co" -> null
        # (1 unchanged attribute hidden)
    }

  # module.bs-co-mtasts.azurerm_dns_cname_record.mta-sts will be updated in-place
  ~ resource "azurerm_dns_cname_record" "mta-sts" {
        id                  = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/benchspace.co/CNAME/mta-sts"
        name                = "mta-sts"
      + record              = (known after apply)
        tags                = {
            "managed"    = "as-code"
            "repository" = "MattWhite-personal/dns-iac"
            "source"     = "terraform"
        }
      - target_resource_id  = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/cdn-mjwmtasts/endpoints/cdnbscomtasts" -> null
        # (4 unchanged attributes hidden)
    }

  # module.bs-co-mtasts.azurerm_dns_txt_record.dnsauth will be created
  + resource "azurerm_dns_txt_record" "dnsauth" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed"    = "as-code"
          + "repository" = "MattWhite-personal/dns-iac"
          + "source"     = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "benchspace.co"

      + record {
          + value = (known after apply)
        }
    }

  # module.bs-co-mtasts.azurerm_dns_txt_record.mta-sts will be updated in-place
  ~ resource "azurerm_dns_txt_record" "mta-sts" {
        id                  = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/benchspace.co/TXT/_mta-sts"
        name                = "_mta-sts"
        tags                = {
            "managed"    = "as-code"
            "repository" = "MattWhite-personal/dns-iac"
            "source"     = "terraform"
        }
        # (4 unchanged attributes hidden)

      - record {
          - value = "v=STSv1; id=a2e2088b69f45448939f1ac44c1c45a6" -> null
        }
      + record {
          + value = "v=STSv1; id=4ea6a9e0bbec85989c50e2c242d95856"
        }
    }

  # module.bs-co-mtasts.azurerm_storage_account.mta-sts will be created
  + resource "azurerm_storage_account" "mta-sts" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = false
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stbscomtasts"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "RG-WhiteFam-UKS"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "managed"    = "as-code"
          + "repository" = "MattWhite-personal/dns-iac"
          + "source"     = "terraform"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (sensitive value)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "01.12:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.bs-co-mtasts.azurerm_storage_account.stmtasts will be destroyed
  # (because azurerm_storage_account.stmtasts is not in configuration)
  - resource "azurerm_storage_account" "stmtasts" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = false -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stbscomtasts" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = false -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "stbscomtasts" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://stbscomtasts.blob.core.windows.net/" -> null
      - primary_blob_host                  = "stbscomtasts.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://stbscomtasts.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "stbscomtasts.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://stbscomtasts.file.core.windows.net/" -> null
      - primary_file_host                  = "stbscomtasts.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://stbscomtasts.queue.core.windows.net/" -> null
      - primary_queue_host                 = "stbscomtasts.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://stbscomtasts.table.core.windows.net/" -> null
      - primary_table_host                 = "stbscomtasts.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://stbscomtasts.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "stbscomtasts.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "RG-WhiteFam-UKS" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "managed"    = "as-code"
          - "repository" = "MattWhite-personal/dns-iac"
          - "source"     = "terraform"
        } -> null
        # (57 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days                     = 7 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [
              - "102.133.216.88/29",
              - "102.133.56.88/29",
              - "13.73.248.16/29",
              - "147.243.0.0/16",
              - "157.55.93.2",
              - "157.55.93.3",
              - "158.23.108.56/29",
              - "172.204.165.112/29",
              - "172.207.68.70",
              - "172.207.68.71",
              - "172.207.69.80/30",
              - "191.233.9.120/29",
              - "191.235.225.128/29",
              - "20.113.254.88/29",
              - "20.115.247.64/29",
              - "20.118.195.128/29",
              - "20.119.155.128/29",
              - "20.150.160.96/29",
              - "20.17.126.64/29",
              - "20.189.106.112/29",
              - "20.192.161.104/29",
              - "20.192.225.48/29",
              - "20.21.37.40/29",
              - "20.210.70.64/30",
              - "20.215.4.240/29",
              - "20.217.44.240/29",
              - "20.36.120.104/29",
              - "20.37.156.120/29",
              - "20.37.195.0/29",
              - "20.37.224.104/29",
              - "20.37.64.104/29",
              - "20.38.136.104/29",
              - "20.38.84.72/29",
              - "20.39.11.8/29",
              - "20.41.192.104/29",
              - "20.41.4.88/29",
              - "20.41.64.120/29",
              - "20.42.129.152/29",
              - "20.42.224.104/29",
              - "20.42.4.120/29",
              - "20.43.130.80/29",
              - "20.43.41.136/29",
              - "20.43.65.128/29",
              - "20.45.112.104/29",
              - "20.45.192.104/29",
              - "20.59.103.64/29",
              - "20.72.18.248/29",
              - "20.79.107.152/29",
              - "20.88.157.176/29",
              - "20.90.132.152/29",
              - "4.213.28.114",
              - "4.213.28.115",
              - "4.213.81.64/29",
              - "4.232.98.120/29",
              - "40.67.48.104/29",
              - "40.74.30.72/29",
              - "40.80.168.104/29",
              - "40.80.184.120/29",
              - "40.80.56.104/29",
              - "40.82.248.248/29",
              - "40.89.16.104/29",
              - "51.104.25.128/29",
              - "51.105.80.104/29",
              - "51.105.88.104/29",
              - "51.107.144.104/29",
              - "51.107.48.104/29",
              - "51.12.193.8/29",
              - "51.12.41.8/29",
              - "51.120.224.104/29",
              - "51.120.40.104/29",
              - "51.137.160.112/29",
              - "51.143.192.104/29",
              - "51.53.30.144/29",
              - "52.136.48.104/29",
              - "52.140.104.104/29",
              - "52.150.136.120/29",
              - "52.159.71.160/29",
              - "52.228.80.120/29",
              - "62.3.75.22",
              - "68.210.172.176/29",
              - "68.221.93.128/29",
              - "69.15.0.0/16",
            ] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - sas_policy {
          - expiration_action = "Log" -> null
          - expiration_period = "01.12:00:00" -> null
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      - static_website {
          - error_404_document = "error.htm" -> null
          - index_document     = "index.htm" -> null
        }
    }

  # module.bs-co-mtasts.azurerm_storage_account_static_website.mta-sts will be created
  + resource "azurerm_storage_account_static_website" "mta-sts" {
      + error_404_document = "error.htm"
      + id                 = (known after apply)
      + index_document     = "index.htm"
      + storage_account_id = (known after apply)
    }

  # module.bs-co-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stbscomtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
            version: STSv1
            mode: testing
            mx: benchspace-co.mail.protection.outlook.com
          - max_age: 86400
          + max_age: 86401
        EOT
      ~ url                    = "https://stbscomtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 5 to destroy.
```
</details>